#include "buzzer.h"


sbit BUZZER = P3^7;

/******************************************
*函数名称：buzzer_init
*输入参数：无
*输出参数：无
*函数功能：蜂鸣器初始化
*备		 注：
*******************************************/
void buzzer_init(void)
{





}

/******************************************
*函数名称：fast_beep
*输入参数：无
*输出参数：无
*函数功能：快速
*备		 注：
*******************************************/
void fast_beep(void)
{


}


/******************************************
*函数名称：short_beep
*输入参数：无
*输出参数：无
*函数功能：短叫
*备		 注：
*******************************************/
void short_beep(void)
{




}

/******************************************
*函数名称：long_beep
*输入参数：无
*输出参数：无
*函数功能：长叫
*备		 注：
*******************************************/
void long_beep(void)
{



}

/******************************************
*函数名称：normal_beep
*输入参数：无
*输出参数：无
*函数功能：正常叫
*备		 注：
*******************************************/
void normal_beep(void)
{



}