#include "i2c.h"

#define RTC_PCF8563_SADDR       (0xA2>>1)
#define RTC_PCF8563_RADDR       (0xA3>>1)


/*******************************************************************************
* 函 数 名         : Delay1us()
* 函数功能		     : 延时
* 输    入         : 无
* 输    出         : 无
*******************************************************************************/

void I2C_Delay10us()
{
	uchar a, b;
	for(b=1; b>0; b--)
	{
		for(a=2; a>0; a--);
	}
}
/*******************************************************************************
* 函 数 名         : I2C_Start()
* 函数功能		     : 起始信号：在I2C_SCL时钟信号在高电平期间I2C_SDA信号产生一个下降沿
* 输    入         : 无
* 输    出         : 无
* 备    注         : 起始之后I2C_SDA和I2C_SCL都为0
*******************************************************************************/

void I2C_Start()
{
	I2C_SDA = 1;
	I2C_Delay10us();
	I2C_SCL = 1;
	I2C_Delay10us();//建立时间是I2C_SDA保持时间>4.7us
	I2C_SDA = 0;
	I2C_Delay10us();//保持时间是>4us
	I2C_SCL = 0;			
	I2C_Delay10us();		
}
/*******************************************************************************
* 函 数 名           : I2C_Stop()
* 函数功能	         : 终止信号：在I2C_SCL时钟信号高电平期间I2C_SDA信号产生一个上升沿
* 输    入           : 无
* 输    出         	 : 无
* 备    注           : 结束之后保持I2C_SDA和I2C_SCL都为1；表示总线空闲
*******************************************************************************/

void I2C_Stop()
{
	I2C_SDA = 0;
	I2C_Delay10us();
	I2C_SCL = 1;
	I2C_Delay10us();//建立时间大于4.7us
	I2C_SDA = 1;
	I2C_Delay10us();	
	
}
/*******************************************************************************
* 函 数 名           : I2cSendByte(uchar num)
* 函数功能 	         : 通过I2C发送一个字节。在I2C_SCL时钟信号高电平期间，
*                    * 保持发送信号I2C_SDA保持稳定
* 输    入           : num ,ack
* 输    出         	 : 0或1。发送成功返回1，发送失败返回0
* 备    注           : 发送完一个字节I2C_SCL=0, 需要应答则应答设置为1，否则为0
*******************************************************************************/

uchar I2C_SendByte(uchar dat, uchar ack)
{
	uchar a = 0,b = 0;//最大255，一个机器周期为1us，最大延时255us。
	// 为了保证时序正确，这里应该加一句 SCL = 0;		
	for(a=0; a<8; a++)//要发送8位，从最高位开始
	{
		I2C_SDA = dat >> 7;	 //起始信号之后I2C_SCL=0，所以可以直接改变I2C_SDA信号
		dat = dat << 1;
		I2C_Delay10us();
		I2C_SCL = 1;
		I2C_Delay10us();//建立时间>4.7us
		I2C_SCL = 0;
		I2C_Delay10us();//时间大于4us		
	}

	I2C_SDA = 1;			// 主设备释放SDA线给从设备去操作
	I2C_Delay10us();
	I2C_SCL = 1;			// 主设备开始了第9个周期
	while(I2C_SDA && (ack == 1))//等待应答，也就是等待从设备把I2C_SDA拉低
	{
		b++;
		if(b > 200)	 //如果超过200us没有应答发送失败，或者为非应答，表示接收结束
		{
			I2C_SCL = 0;
			I2C_Delay10us();
			return 0;
		}
	}

	I2C_SCL = 0;
	I2C_Delay10us();
 	return 1;		
}
/*******************************************************************************
* 函 数 名         : I2cReadByte()
* 函数功能	    	 : 使用I2c读取一个字节
* 输    入         : 无
* 输    出         : dat
* 备    注         : 接收完一个字节I2C_SCL=0
*******************************************************************************/

uchar I2C_ReadByte()
{
	uchar a = 0,dat = 0;
	I2C_SDA = 1;			//起始和发送一个字节之后I2C_SCL都是0
	I2C_Delay10us();
	// 按道理这里应该有一个SCL = 0的
	for(a=0; a<8; a++)//接收8个字节
	{
		I2C_SCL = 1;		// 通知从设备我要开始读了，可以放1bit数据到SDA了
		I2C_Delay10us();
		dat <<= 1;			// 读取的时候是高位在前的
		dat |= I2C_SDA;
		I2C_Delay10us();
		I2C_SCL = 0;		// 拉低，为下一个bit的周期做准备
		I2C_Delay10us();
	}
	return dat;		
}

/******************************************
*函数名称：I2C_WriteReg
*输入参数：寄存器写入地址和要写入的数据
*输出参数：无
*函数功能：向指定的寄存器写入数据
*备		 注：
*******************************************/


void I2C_WriteReg(unsigned char addr,unsigned char *dat)
{
	I2C_Start();
	I2C_SendByte(RTC_PCF8563_SADDR, 1);
	I2C_SendByte(addr, 1);
	I2C_SendByte(*dat, 0);	
	I2C_Stop();
}
/******************************************
*函数名称：I2C_ReadReg
*输入参数：iic读取地址，dat数据缓冲区
*输出参数：无
*函数功能：读取寄存器地址上的数据
*备		 注：
*******************************************/

void I2C_ReadReg(unsigned char addr,unsigned char *dat)
{

	I2C_Start();
	I2C_SendByte(RTC_PCF8563_SADDR, 1); 
	I2C_SendByte(addr, 1); 
	
	I2C_Start();
	I2C_SendByte(RTC_PCF8563_RADDR, 1); 
	
	*dat=I2C_ReadByte(); 
	
	I2C_Stop();
	
}