#include "time2.h"

#define T38_4KHZ    (256-11059200/12/38400/2)


sfr IE2   =  0xAF;
sfr AUXR  =  0x8E;
sfr T2H   =  0xD6;
sfr T2L   =  0xD7;



/******************************************
*函数名称：time2_init
*输入参数：无
*输出参数：无
*函数功能：定时器2初始化
*备		 注：
*******************************************/
void time2_init(void)
{

	T2L   = T38_4KHZ;       //设置定时器2装载值
	T2H   = T38_4KHZ >> 8; 
		
	AUXR |= 0x10;           //开始运行
	
	IE2  |= 0x04;           //开启定时器2中断
	EA    = 1;              //开启总中断

}

/******************************************
*函数名称：timer2_irq
*输入参数：无
*输出参数：无
*函数功能：定时器2中断函数
*备		 注：
*******************************************/

void timer2_irq (void) interrupt 12 using 1
{

	
	
	
}








/******************************************
*函数名称：timer2_int
*输入参数：无
*输出参数：无
*函数功能：定时器2中断函数
*备		 注：
*******************************************/
void timer2_int (void) interrupt 1
{

	
	
	
	
}






















